GRADE_CHOICES = (
    ("선택안함", "선택안함"),
    ("1학년", "1학년"),
    ("2학년", "2학년"),
    ("3학년", "3학년"),
    ("4학년", "4학년"),
    ("졸업생", "졸업생"),
)

LEVEL_CHOICES = (
    ("3", "Lv3_미인증사용자"),
    ("2", "Lv2_인증사용자"),
    ("1", "Lv1_관리자"),
    ("0", "Lv0_개발자"),
)

CIRCLES_CHOICES = (
    ("미가입", "미가입"),
    ("NUXPIA", "NUXPIA"),
    ("NET", "NET"),
    ("DOT-GABI", "DOT-GABI"),
    ("IMAGINE", "IMAGINE"),
    ("P&N", "P&N"),
    ("MEGA-BRAIN", "MEGA-BRAIN"),
)

DEPARTMENT_CHOICES = (
    ("선택안함", "선택안함"),
    ("외부인", "학부생이 아님"),
    ("컴퓨터공학부", "컴퓨터공학부"),
    ("드론IOT시뮬레이션학부", "드론IOT시뮬레이션학부"),
    ("의과대학", "의과대학"),
    ("문리과대학", "문리과대학"),
    ("사회과학대학", "사회과학대학"),
    ("공과대학", "공과대학"),
    ("보건의료융합대학", "보건의료융합대학"),
    ("BNIT융합대학", "BNIT융합대학"),
    ("약학대학", "약학대학"),
)

CATEGORY_CHOICES = (
    ("자유", "자유"),
    ("질문", "질문"),
    ("정보", "정보"),
)